app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at", "vimeo_access_token", "vimeo_client_id", "vimeo_client_secret") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"